### PyCity Schools Analysis
* Overall,smaller schools seemed to peform better in math, reading and overall passing grades. School size seems to play an important role in the overall passing scores.

* The data indicates that schools with higher budgets and higher spending per student did not necessary yield better test results.

* More analysis may be required to required to determine if the effect is due to smaller school sizes or other factors, especially when considering the performance of Charter Schools

In [4]:
import os
#import csv
import pandas as pd
import numpy as np

#create path variable and assign relevant file names.
fp_students=os.path.join("Resources","students_complete.csv")
fp_schools=os.path.join("Resources","schools_complete.csv")

#read files into pandas data frames.
students_df = pd.read_csv(fp_students)

schools_df  = pd.read_csv(fp_schools)

print(students_df.head(3))
print(schools_df.head(3))
#students_df.columns

   Student ID     student_name gender grade        school_name  reading_score  \
0           0     Paul Bradley      M   9th  Huang High School             66
1           1     Victor Smith      M  12th  Huang High School             94
2           2  Kevin Rodriguez      M  12th  Huang High School             90

   math_score
0          79
1          61
2          60
   School ID           school_name      type  size   budget
0          0     Huang High School  District  2917  1910635
1          1  Figueroa High School  District  2949  1884411
2          2   Shelton High School   Charter  1761  1056600

In [5]:
#Determine district totals like total schools, total students, total budget, avg math score, avg reading score, % passing match, 
# % passing reading and overall passing rate. 
school_count= schools_df["school_name"].count()
student_count = students_df["Student ID"].count()
tot_budget = schools_df["budget"].sum()
mean_reading_score = students_df["reading_score"].mean()
mean_math_score = students_df["math_score"].mean()

#print values to verify 
#print(student_count)
print(school_count)
print(student_count)
print(tot_budget)
print(mean_reading_score)
print(mean_math_score)

15
39170
24649428
81.87784018381414
78.98537145774827

In [6]:
#Calulate number of students passing math and then use total student count to calculate % passing math. 
pass_math_df_cnt = students_df.loc[students_df["math_score"] > 70,:]["Student ID"].count()
#pass_math_df_cnt
pass_math_percent = (pass_math_df_cnt / student_count)*100
print(pass_math_percent)

#Calc % passing reading in a similar fashion. 
pass_reading_df_cnt = students_df.loc[students_df["reading_score"] > 70]["Student ID"].count()
pass_reading_df_cnt
pass_reading_percent = (pass_reading_df_cnt / student_count)*100
print(pass_reading_percent)

#calc overall pass percent as average of % passing math and % passing  reading.
overall_pass_percent = (pass_math_percent + pass_reading_percent) / 2 
print(overall_pass_percent)

72.39213683941792
82.97166198621395
77.68189941281594

In [7]:
#Create a summary dict with all the values calculated above and covert to a dataframe. 
summary_dict={"Total Schools": [school_count], "Total Students": [student_count],"Total Budget":tot_budget,
              "Average Math Score":mean_math_score,"Average Reading Score":mean_reading_score,
              "% Passing Math":pass_math_percent,"% Passing Reading":pass_reading_percent,
              "Overall Passing Rate":overall_pass_percent}

summary_dist_df = pd.DataFrame(summary_dict,columns=["Total Schools","Total Students","Total Budget","Average Math Score",
                                                     "Average Reading Score","% Passing Math","% Passing Reading",
                                                     "Overall Passing Rate"])
summary_dist_df.head()

,Total Schools,Total Students,Total Budget,Average Math Score,Average Reading Score,% Passing Math,% Passing Reading,Overall Passing Rate
0,15,39170,24649428,78.985371,81.87784,72.392137,82.971662,77.681899

### District Summary

In [8]:
#Final district summary and formatting based on above values. 
summary_dist_df["Total Students"] = summary_dist_df["Total Students"].map("{:,}".format)
summary_dist_df["Total Budget"]   = summary_dist_df["Total Budget"].map("${:,.2f}".format)
summary_dist_df.head()

,Total Schools,Total Students,Total Budget,Average Math Score,Average Reading Score,% Passing Math,% Passing Reading,Overall Passing Rate
0,15,"39,170","$24,649,428.00",78.985371,81.87784,72.392137,82.971662,77.681899

### School Summary

In [9]:
#Perform steps to determine values needed for school summary.
schools_ren_df = schools_df.rename(columns={"name": "school"})
#schools_ren_df = schools_ren_df.set_index("school")
del schools_ren_df["School ID"]
schools_ren_df.head(2)

            school_name      type  size   budget
0     Huang High School  District  2917  1910635
1  Figueroa High School  District  2949  1884411

### Reading and math scores by school

In [10]:
#mean of reading and math scores by school
students_df_groupsch_avg = students_df.groupby('school_name').mean()
del students_df_groupsch_avg["Student ID"]
students_df_groupsch_avg.reset_index(level=0, inplace=True)
students_df_groupsch_avg = students_df_groupsch_avg.rename(columns={"reading_score":"avg_reading_score",
                                                                    "math_score":"avg_math_score"})
#students_df_groupsch_avg["school"]=students_df_groupsch_avg.index
students_df_groupsch_avg.head(3)

            school_name  avg_reading_score  avg_math_score
0    Bailey High School          81.033963       77.048432
1   Cabrera High School          83.975780       83.061895
2  Figueroa High School          81.158020       76.711767

### Passing math by school

In [11]:
## Count of students passing math by school
#students_df_groupsch.loc[students_df_groupsch["math_score" > 70]]
school_stu_math_df = students_df.loc[students_df["math_score"] > 70,:]
#school_stu_math_df_cnt= school_stu_math_df.groupby('school').count()
#school_stu_math_df_cnt= school_stu_math_df.groupby('school')["Student ID"].count()
school_stu_math_df_cnt= school_stu_math_df.groupby('school_name').count()

school_stu_math_df_cnt.reset_index(level=0,inplace=True)
school_stu_math_df_cnt=school_stu_math_df_cnt[["school_name", "math_score"]]
school_stu_math_df_cnt = school_stu_math_df_cnt.rename(columns={"math_score":"pass_math_count"})
school_stu_math_df_cnt.head(3)

            school_name  pass_math_count
0    Bailey High School             3216
1   Cabrera High School             1664
2  Figueroa High School             1880

In [12]:
#total students by school.
students_df_groupsch_totstudents = students_df.groupby('school_name').count()
#students_df_groupsch_totstudents = students_df.groupby(['school'])["name"].count()

#students_df_groupsch_totstudents = pd.DataFrame(students_df_groupsch_totstudents,columns=["Total Student Count"])
students_df_groupsch_totstudents.reset_index(level=0,inplace=True)
#del students_df_groupsch_totstudents[["name","gender","grade","reading_score","math_score"]]
students_df_groupsch_totstudents= students_df_groupsch_totstudents[["school_name","student_name"]]
students_df_groupsch_totstudents = students_df_groupsch_totstudents.rename(columns={"name":"Total_student_count"})
students_df_groupsch_totstudents.head(3)

            school_name  student_name
0    Bailey High School          4976
1   Cabrera High School          1858
2  Figueroa High School          2949

### Passing reading by school

In [13]:
#Count of students passing reading.
school_stu_read_df = students_df.loc[students_df["reading_score"] > 70,:]
#school_stu_read_df.head(10)
#school_stu_read_df_cnt= school_stu_read_df.groupby('school')["name"].count()
school_stu_read_df_cnt= school_stu_read_df.groupby('school_name').count()
school_stu_read_df_cnt.reset_index(level=0,inplace=True)
school_stu_read_df_cnt=school_stu_read_df_cnt[["school_name","reading_score"]]
#rename column to pass reading count 
school_stu_read_df_cnt=school_stu_read_df_cnt.rename(columns={"reading_score":"pass_reading_cnt"})
school_stu_read_df_cnt.head(3)

            school_name  pass_reading_cnt
0    Bailey High School              3946
1   Cabrera High School              1744
2  Figueroa High School              2313

### Merge school & average scores

In [14]:
#merge school info and average scores for new summary dataframe1
school_mrg1= pd.merge(schools_ren_df ,students_df_groupsch_avg, on="school_name")
school_mrg1.head(3)

,school_name,type,size,budget,avg_reading_score,avg_math_score
0,Huang High School,District,2917,1910635,81.182722,76.629414
1,Figueroa High School,District,2949,1884411,81.158020,76.711767
2,Shelton High School,Charter,1761,1056600,83.725724,83.359455

In [15]:
school_mrg1b= pd.merge(school_mrg1, students_df_groupsch_totstudents, on="school_name" )
#rename column to pass reading count 
school_stu_read_df_cnt.head(3)

            school_name  pass_reading_cnt
0    Bailey High School              3946
1   Cabrera High School              1744
2  Figueroa High School              2313

### Merge with total students

In [16]:
#merge the dataframe with total students into the above mrg1 dataframe
school_mrg2 = pd.merge(school_mrg1b,students_df_groupsch_avg, on="school_name")
school_mrg2=school_stu_read_df_cnt.rename(columns={"pass_reading_cnt":"student_count"})
school_mrg2.head(3)

            school_name  student_count
0    Bailey High School           3946
1   Cabrera High School           1744
2  Figueroa High School           2313

### Merge pass math & reading total students

In [37]:
school_readmath_cnt_mrg3 = pd.merge(school_stu_read_df_cnt, school_stu_math_df_cnt, on="school_name")
school_readmath_cnt_mrg3.head(3)

            school_name  pass_reading_cnt  pass_math_count
0    Bailey High School              3946             3216
1   Cabrera High School              1744             1664
2  Figueroa High School              2313             1880

### Add math and student pass & Per Student Budget

In [38]:
# add math and student pass counts to the merge dataframe - result is mrg4.
school_mrg4 = pd.merge(school_mrg2 ,school_readmath_cnt_mrg3, on="school_name")

In [39]:
#Calculate % passing Math and percent passing reading. 
school_mrg4["percent passing math"] = (school_mrg4["pass_math_count"] * 100)/(school_mrg4["student_count"])
school_mrg4["percent passing Reading"] = (school_mrg4["pass_reading_cnt"] * 100)/(school_mrg4["student_count"])
school_mrg4["Per Student Budget"] = schools_ren_df["budget"]/school_mrg4["student_count"]
school_mrg4=school_mrg4.rename(columns={"pass_reading_cnt":"student_count"})
school_mrg4.head(3)

,school_name,student_count,student_count,pass_math_count,percent passing math,percent passing Reading,Per Student Budget
0,Bailey High School,3946,3946,3216,81.500253,100.0,484.195388
1,Cabrera High School,1744,1744,1664,95.412844,100.0,1080.510894
2,Figueroa High School,2313,2313,1880,81.279723,100.0,456.809339

### Rename columns

In [40]:
#Rename columns to meaningful names 
school_mrg4 = school_mrg4.rename(columns={"school_name":"School Name","type":"School Type","pass_math_count":"Passing Math Totals",
                   "avg_reading_score":"Average Reading Score","avg_math_score":"Average Math Score",
                    "student_count":"Total Students","percent passing math":"% Passing Math",
                   "percent passing Reading":"% Passing Reading","overall passing rate":"Overall Passing Rate",
                   "Per Student Budget":"Per Student Budget"})
school_mrg4.head(3)

,School Name,Total Students,Total Students,Passing Math Totals,% Passing Math,% Passing Reading,Per Student Budget
0,Bailey High School,3946,3946,3216,81.500253,100.0,484.195388
1,Cabrera High School,1744,1744,1664,95.412844,100.0,1080.510894
2,Figueroa High School,2313,2313,1880,81.279723,100.0,456.809339

### School summary merge (could not get to work)

In [47]:
school_summary_merge = pd.merge(summary_dist_df, school_mrg4, on='school_name')

In [ ]:


School_summary_df = school_mrg4[["School Name","School Type","Total Students","Total School Budget","Per Student Budget",
                                 "Average Math Score","Average Reading Score","% Passing Math","% Passing Reading",
                                 "Overall Passing Rate"]]
#convert budget amounts to numeric values before formatting. 
School_summary_df['Total School Budget'] = pd.to_numeric(School_summary_df["Total School Budget"])
School_summary_df['Per Student Budget'] = pd.to_numeric(School_summary_df["Per Student Budget"])
##School_summary_df.head(3)
##School_summary_df.dtypes
#Keep a dataframe with numeric values for relevant fields. 
School_summary_dfnum = School_summary_df.copy()
School_summary_dfnum.head(3)
#School_summary_dfnum.dtypes